<a href="https://colab.research.google.com/github/Unicorndy/Data_cleaning_with_python_pandas/blob/master/Data_cleaning_with_python_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [58]:
# Clone the entire repo.
!git clone -l -s https://github.com/dataoptimal/posts cloned-repo
%cd cloned-repo
!ls

Cloning into 'cloned-repo'...
warning: --local is ignored
remote: Enumerating objects: 39, done.
remote: Total 39 (delta 0), reused 0 (delta 0), pack-reused 39
Unpacking objects: 100% (39/39), done.
/content/cloned-repo/data cleaning with python and pandas/cloned-repo/data cleaning with python and pandas/cloned-repo
'Advanced logistic regression_the definitive guide to collinearity'
'algorithms from scratch'
'business impact project'
'data cleaning with python and pandas'
'data cleaning with R and the tidyverse'
 README.md

In [59]:
%cd data cleaning with python and pandas
!ls

/content/cloned-repo/data cleaning with python and pandas/cloned-repo/data cleaning with python and pandas/cloned-repo/data cleaning with python and pandas
'property data.csv'

In [60]:
import pandas as pd
import numpy as np

#read csv file into dataframe
df =pd.read_csv("property data.csv")

#checking for missing value
display(df.head(9))

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [61]:
#checking data type in this sample
display(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
PID             8 non-null float64
ST_NUM          7 non-null float64
ST_NAME         9 non-null object
OWN_OCCUPIED    8 non-null object
NUM_BEDROOMS    7 non-null object
NUM_BATH        8 non-null object
SQ_FT           8 non-null object
dtypes: float64(2), object(5)
memory usage: 584.0+ bytes

None

In [62]:
#checking ST_NUM column
display(df['ST_NUM'])
display(df['ST_NUM'].isnull())

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [63]:
#checking for different notation of missing value in the sample data
display(df['NUM_BEDROOMS'])
display(df['NUM_BEDROOMS'].isnull())

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7      1
8     na
Name: NUM_BEDROOMS, dtype: object

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [64]:
#making a list of missing value types
missing_values=['na','--']
df=pd.read_csv('property data.csv',na_values=missing_values)
#checking for missing value
display(df.head(9))
#checking for NUM_BEDROOMS missing value
display(df['NUM_BEDROOMS'])
display(df['NUM_BEDROOMS'].isnull())

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

In [65]:
#inspecting OWN_OCCUPIED COLUMN
display(df['OWN_OCCUPIED'])
display(df['OWN_OCCUPIED'].isnull())

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [66]:
#changing invalid entry to missing value
row_number = 0
for row in df['OWN_OCCUPIED']:
  try:
    int(row) #to check if entry can be change into integer
    df.loc[row_number,'OWN_OCCUPIED']=np.nan #change invalid entry into missing value
  except ValueError:
    pass #continue if entry cannot be change into integer
  row_number+=1

#inspecting OWN_OCCUPIED COLUMN
display(df['OWN_OCCUPIED'])
display(df['OWN_OCCUPIED'].isnull())

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [67]:
#inspecting NUM_BATH COLUMN
display(df['NUM_BATH'])
display(df['NUM_BATH'].isnull())

0         1
1       1.5
2         1
3       NaN
4         2
5         1
6    HURLEY
7         1
8         2
Name: NUM_BATH, dtype: object

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
Name: NUM_BATH, dtype: bool

In [68]:
#changing invalid entry to missing value
row_number = 0
for row in df['NUM_BATH']:
  try:
    int(row) #to check if entry can be change into integer
  except ValueError:
    df.loc[row_number,'NUM_BATH']=np.nan #change invalid entry into missing value
    pass #continue if entry cannot be change into integer
  row_number+=1
  #inspecting NUM_BATH COLUMN
display(df['NUM_BATH'])
display(df['NUM_BATH'].isnull())

0      1
1    NaN
2      1
3    NaN
4      2
5      1
6    NaN
7      1
8      2
Name: NUM_BATH, dtype: object

0    False
1     True
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: NUM_BATH, dtype: bool

In [69]:
#total missing value for each feature
display (df.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        3
SQ_FT           2
dtype: int64

In [70]:
#code for checking any missing values
display(df.isnull().values.any())

True

In [71]:
#check total number of missing value
display(df.isnull().sum().sum())

13

In [72]:
#Replace missing value of NUM_BEDROOMS and SQ_FT with median value only. (median value not applicable for other features)
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

median = df['SQ_FT'].median()
df['SQ_FT'].fillna(median, inplace=True)
#checking all missing value has been replace by nan and valid nan replace by median
display(df)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      NaN   950.0
2  100003000.0     NaN   LEXINGTON            N           2.5        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.5        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1   950.0
8  100009000.0   215.0     TREMONT            Y           2.5        2  1800.0